<script setup lang="ts">

import SupportElement from "./SupportElement.vue";

const questions = [
  {
    question: "Как заказать поездку",
    answer: "Выберите нужный вид поездки. Затем выберите нужный класс автомобиля. Заполните все поля в форме заказа. Оплатите поездку. После этого Вам придет подтверждение на электронную почту. Если возникнут вопросы, напишите на электронную почту или позвоните диспетчеру <a href=\"tel:+79315213066\">8 (931) 521-30-66.</a>"
  },
  {
    question: "Как отменить заказ и вернуть предоплату?",
    answer: "Для отмены поездки свяжитесь с диспетчером <a href=\"tel:+79315213066\">8 (931) 521-30-66</a>. При срочной отмене поездки мы не сможем вернуть вам предоплату. Время, когда отмена заказа без потерь будет невозможна, указывается в письме с подтверждением трансфера. Вы можете отменить бронирование с полным возвратом уплаченной суммы: в срок более 4 часов до начала поездки для автомобилей класса стандарт, комфорт, минивэн; в срок более 12 часов до начала поездки для автомобилей класса бизнес. Если отмена произошла позже, могут применяться штрафные санкции в соответствии с условиями, указанными в подтверждении поездки. Возврат осуществляется в течение 3-5 дней на банковскую карту."
  },
  {
    question: "Как изменить заказ?",
    answer: "Для изменения поездки свяжитесь с диспетчером <a href=\"tel:+79315213066\">8 (931) 521-30-66</a>. Важно: изменения в заказе, которые поступили менее чем на 12 часов, могут быть не приняты."
  },
  {
    question: "Как связаться с водителем и что делать, если меня не встретили?",
    answer: "До начала трансфера мы отправим вам контактный телефон водителя и данные машины. Мы гарантируем, что водитель сделает все, чтобы связаться с вами и выполнить заказанную вами поездку. Пожалуйста, держите телефон включенным. Если водитель не выходит на связь, свяжитесь с диспетчером <a href=\"tel:+79315213066\">8 (931) 521-30-66</a>."
  }
];

</script>

<template>
  <section id="support">
    <h2>Помощь</h2>
    <ul>
      <SupportElement classes="support-element" v-for="item in questions" :key="item.question" :question="item.question"
                      :answer="item.answer"/>
    </ul>
  </section>
</template>

<style scoped lang="scss">
section {
  @include padding-container;
  background: white;
  padding-top: 8rem;
  padding-bottom: 8rem;

  h2 {
    margin-bottom: 6rem;
  }

  .support-element {
    border-top: 1px solid rgb(238, 238, 238);
    padding: 25px 0;
  }

  .support-element:nth-of-type(4) {
    border-bottom: 1px solid rgb(238, 238, 238);
  }
}
</style>
